{
    "1": "You can use the --help flag to get more information about the available commands.",
    "2": "Make sure your FreeTube data file is accessible and not corrupted.",
    "3": "If you encounter issues, try running the command with the --verbose flag for more detailed output.",
    "4": "You can schedule regular exports using cron syntax with the --cron flag.",
    "5": "If you're unsure about a specific option, refer to the documentation for more information.",
    "6": "For whatever reason the best place to find help is the README file.",
    "7": "If you want to export only specific data (like history or playlists), use the corresponding flags.",
    "8": "These hints output from a JSON file during the wait time for a cron job to start.",
    "9": "Make sure to check the logs for any errors or warnings.",
    "10": "You can enable logging to a file by using --logs, the default name is ft-to-inv-timestamp.log",
    "11": "This project is open source, feel free to contribute or report issues on GitHub <https://github.com/riki-pedia/ft-to-inv>",
    "12": "If you have any questions or feedback, please reach out!",
    "13": "Remember to keep your FreeTube and Invidious instances updated for the best compatibility.",
    "14": "The latest supported version of FreeTube is v0.23.8 beta",
    "15": "There are many features in the package, try to use as many as you can!",
    "16": "I have plans to make a web UI for the people that hate the command line, stay tuned!",
    "17": "If you want to see the code, it's all on GitHub <https://github.com/riki-pedia/ft-to-inv>",
    "18": "Feel free to open an issue or submit a pull request if you have suggestions!",
    "19": "FreeTube and Invidious are both open source projects, consider supporting them if you can. <https://github.com/FreeTubeApp/FreeTube> <https://github.com/iv-org/invidious>",
    "20": "You can run first time setup any time with the --first-time-setup flag.",
    "21": "You can use the --dry-run flag to see what would be exported without actually making any changes.",
    "22": "Make sure to update the package for the newest features and bug fixes! Just run `npm i ft-to-inv@latest -g`",
    "23": "I also have the same package hosted on GitHub packages, use <https://github.com/riki-pedia/ft-to-inv/pkgs/npm/ft-to-inv> if you have issues with npmjs.",
    "24": "I don't have any official support channels, but you can reach out on GitHub!",
    "25": "I publish a very unprofessional changelog for each release, you can find it in the GitHub releases.",
    "26": "Something tells me you have a long cron job ahead of you.",
    "27": "If you want to stop the cron job, just press Ctrl+C",
    "28": "I have a few testing flags that aren't documented yet, but scattered throughout the hints!",
    "29": "--clear-files is a flag that clears your export files, use it with caution! (just a test flag)",
    "30": "If you want to see what the config file looks like, you can check out config.example.json in the GitHub repo.",
    "31": "The --no-sync flag disables the syncing to the Invidious API, instead exports one invidious-import.json file that you can import manually.",
    "32": "The --clear-config flag deletes the config file and the import files for a fresh start.",
    "33": "It would minorly annoy me if you went to the GitHub and read through all of these.",
    "34": "I'm not very good at writing README files, so I make other forms of documentation that also suck. Sorry. Not really.",
    "35": "If you have any suggestions for improvement, feel free to open an issue on GitHub.",
    "36": "If you have a long enough Cron job, you might see some of these hints multiple times!",
    "37": "I might or might not put one or more of these hints in here twice, be on the lookout! (or just leave the computer like a normal person, I'm not judging)",
    "38": "If you like this project, consider giving it a star on GitHub!",
    "39": "You can use the --export-dir flag to specify a custom export directory",
    "40": "You can use the --freetube-dir flag to specify a custom FreeTube directory",
    "41": "You can specifiy whether or not to export history, playlists, and subscriptions with the --history, --playlists, and --subscriptions flags",
    "42": "Haven't made support for combining short flags like -vs (Verbose, Subscriptions) yet, but it's somewhere on the void that is my to-do list.",
    "43": "There's retry logic for failed Invidious API calls, it retries up to 3 times for the weaker self-hosted instances.",
    "44": "If you want to see more detailed logs, use the --verbose flag.",
    "45": "The --clear-config flag deletes the config file and the import files for a fresh start.",
    "46": "There's also support for using environment variables to configure the tool.",
    "47": "You can set the environment variable FT_TO_INV_CONFIG to specify a custom config file path.",
    "48": "You can set the environment variable FT_TO_INV_EXPORT_DIR to specify a custom export directory.",
    "49": "You can set the environment variable FT_TO_INV_FREETUBE_DIR to specify a custom FreeTube directory.",
    "50": "You can set the environment variable FT_TO_INV_HISTORY to specify whether or not to export history.",
    "51": "You can set the environment variable FT_TO_INV_PLAYLISTS to specify whether or not to export playlists.",
    "52": "You can set the environment variable FT_TO_INV_SUBSCRIPTIONS to specify whether or not to export subscriptions.",
    "53": "Currently, there are about 5000 downloads on npm. You should get that number higher!",
    "54": "you should try out my other projects too, check out my GitHub at https://github.com/riki-pedia",
    "55": "I challenge you to write a better README and open a PR.",
    "56": "I'm working on accepting positional args right now, so it would look something like this: ft-to-inv arg rather than ft-to-inv --arg",
    "57": "This must be a long cron job",
    "58": "These don't actually save to a log file, you'll only see them in the console.",
    "59": "I just had a huge migration to ES, so development might be slow as I bug hunt for a little while.",
    "60": "The main file is almost 2000 lines of code, and it has a lot of room for improvement.",
    "61": "If you have any suggestions for improvement, feel free to open an issue on GitHub.",
    "62": "It's possible I might make a reverse export system, like Invidious to FreeTube, but no promises.",
    "63": "If you have any questions or need help, don't hesitate to reach out!",
    "64": "This one will just be nothing helpful, enjoy waiting for the next one!",
    "65": "If you see this, it means the hints are working!",
    "66": "'h'",
    "67": "this is number 67",
    "68": "The latest version of Invidious that's supported is v2.20250517.0, which is also the latest release. i think.",
    "69": "This hint file is getting long.",
    "70": "I might add an offline mode, so keep an eye on the GitHub repo for updates. <https://github.com/riki-pedia/ft-to-inv>",
    "71": "This was originally a single file, but it's grown quite a bit!",
    "72": "At first, this was just a tool for me to keep my FreeTube and Invidious data in sync, but I thought it could be useful for others as well, so I published to npm.",
    "73": "This is one large file.",
    "74": "There's currently about 7 helper scripts for this tool, I expect that number to grow.",
    "75": "There's also a lot of room for improvement in the code quality and organization.",
    "76": "h",
    "77": "If you want to contribute, feel free to open a pull request on GitHub!",
    "78": "I might add support for more data types in the future, like watch later and liked videos.",
    "79": "If you like this project, consider giving it a star on GitHub!",
    "80": "If you want this cron job to run quieter you can use the --silent flag to suppress all console output (except these!).",
    "81": "You can also install this tool through the GitHub packages registry if you have issues with npmjs. Just use <https://github.com/riki-pedia/ft-to-inv> \nexample: npm install https://github.com/riki-pedia/ft-to-inv -g",
    "82": "Make sure to support Invidious and FreeTube if you can, both are amazing open source projects! <https://github.com/iv-org/invidious> <https://github.com/FreeTubeApp/FreeTube>",
    "83": "I'm currently working on a web UI for this tool, so stay tuned!",
    "84": "If you want to see the code, it's all on GitHub <https://github.com/riki-pedia/ft-to-inv>",
    "85": "Feel free to open an issue or submit a pull request if you have suggestions!",
    "86": "You can run first time setup any time with the --first-time-setup flag.",
    "87": "You can use the --dry-run flag to see what would be exported without actually making any changes.",
    "88": "Your mission is to update the documentation, should you choose to accept.",
    "89": "number 88 is a mission impossible reference",
    "90": "how long is your cron job?",
    "91": "theres plugins that you can install or make for ft-to-inv that add extra stuff",
    "92": "if you noticed there are some repeated hints, its intentional",
    "93": "a lot has changed since the last release, check out the changelog on github! the current release is 2.2.0 (although im writing this in 2.1.0)",
    "94": "theres over 90 of these now, i sincerely hope your not staring at your terminal waiting for your cron job to start",
    "95": "GUESS THE NUMBER 100% NOT CLICKBAIT (IMPOSSIBLE)",
    "96": "im currently testing a feature where you can import the cli as a library in your own projects to use the core (for gui apps and stuff)",
    "97": "if you saw this go star the repo here: https://github.com/riki-pedia/ft-to-inv",
    "98": "2 + 2 = 5 :)",
    "99": "this tool is pretty cool, you should tell your friends about it",
    "100": "you can also use your third favorite js runtime (like deno or bun) because they have pretty good node compatibility",
    "101": "you can use your second favorite node package manager (yarn, pnpm, regular npm) to install this package",
    "102": "while there are typescript declarations, im still scared of typescript, all the code is in ESM javascript",
    "103": "check the readme for my very bad documentation",
    "104": "enjoy the long cron job in the shell your probably not looking at right now",
    "105": "if you want logging to a file (REALLY useful here) use the --logs flag (see `ft-to-inv help logs` for more info)",
    "106": "       ",
    "107": "i made a marketplace for plugins for the tool, check out the built-in installer (ft-to-inv marketplace) or look at the github repo for more info",
    "108": "what if i told you",
    "109": "im working on locking down the plugin system for security reasons, more info in the readme",
    "110": "if enough people ask for it i might make pre-packed binaries using bun or something",
    "111": "these are in random order, but cleanly numbered in the github repo",
    "112": "sudo rm -rf / --no-preserve-root \n jk dont run that",
    "113": "i also make some other 'cool' and 'useful' open source projects, check out my github: <https://github.com/riki-pedia>",
    "114": "hint: dont press alt+f4",
    "115": "this whole repo is built on javascript (specifically nodejs) and some boring json files.",
    "116": "i might make a private bug reporting system (for security stuff) if enough people want it",
    "117": "this tool was originally meant to be a one-off script for myself, but i thought others might find it useful too",
    "118": " check back for more hints in the next release!"
}
